wsarachai/esp32-app/main/water_humidity_oneshot.c
/*
 * water_adc_oneshot.c
 *
 *  Created on: May 16, 2024
 *      Author: keng
 */

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_log.h"
#include "soc/soc_caps.h"
#include "esp_log.h"
#include "esp_adc/adc_oneshot.h"
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"

#include "water_humidity_oneshot.h"
#include "tasks_common.h"

static char TAG[] = "WATER_HUMIDITY";

static adc_oneshot_unit_handle_t adc1_handle;


static int adc_raw[10];
static int voltage[10];

int water_humidity_get_raw_data(void)
{
	return adc_raw[0];
}

int water_humidity_get_voltage(void)
{
	return voltage[0];
}

/*---------------------------------------------------------------
        ADC Calibration
---------------------------------------------------------------*/
static bool water_humidity_adc_calibration_init(adc_unit_t unit, adc_channel_t channel, adc_atten_t atten, adc_cali_handle_t *out_handle)
{
    adc_cali_handle_t handle = NULL;
    esp_err_t ret = ESP_FAIL;
    bool calibrated = false;

#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    if (!calibrated) {
        ESP_LOGI(TAG, "calibration scheme version is %s", "Curve Fitting");
        adc_cali_curve_fitting_config_t cali_config = {
            .unit_id = unit,
            .chan = channel,
            .atten = atten,
            .bitwidth = ADC_BITWIDTH_DEFAULT,
        };
        ret = adc_cali_create_scheme_curve_fitting(&cali_config, &handle);
        if (ret == ESP_OK) {
            calibrated = true;
        }
    }
#endif

#if ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    if (!calibrated) {
        ESP_LOGI(TAG, "calibration scheme version is %s", "Line Fitting");
        adc_cali_line_fitting_config_t cali_config = {
            .unit_id = unit,
            .atten = atten,
            .bitwidth = ADC_BITWIDTH_DEFAULT,
        };
        ret = adc_cali_create_scheme_line_fitting(&cali_config, &handle);
        if (ret == ESP_OK) {
            calibrated = true;
        }
    }
#endif

    *out_handle = handle;
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "Calibration Success");
    } else if (ret == ESP_ERR_NOT_SUPPORTED || !calibrated) {
        ESP_LOGW(TAG, "eFuse not burnt, skip software calibration");
    } else {
        ESP_LOGE(TAG, "Invalid arg or no memory");
    }

    return calibrated;
}

static void water_humidity_adc_calibration_deinit(adc_cali_handle_t handle)
{
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    ESP_LOGI(TAG, "deregister %s calibration scheme", "Curve Fitting");
    ESP_ERROR_CHECK(adc_cali_delete_scheme_curve_fitting(handle));

#elif ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    ESP_LOGI(TAG, "deregister %s calibration scheme", "Line Fitting");
    ESP_ERROR_CHECK(adc_cali_delete_scheme_line_fitting(handle));
#endif
}

static void WATER_HUMIDITY_task(void *pvParameter)
{
    //-------------ADC1 Init---------------//
    adc_oneshot_unit_init_cfg_t init_config1 = {
        .unit_id = ADC_UNIT_1,
    };
    ESP_ERROR_CHECK(adc_oneshot_new_unit(&init_config1, &adc1_handle));

    //-------------ADC1 Config---------------//
    adc_oneshot_chan_cfg_t config = {
        .bitwidth = ADC_BITWIDTH_DEFAULT,
        .atten = WATER_ADC_ATTEN,
    };
    ESP_ERROR_CHECK(adc_oneshot_config_channel(adc1_handle, WATER_ADC1_CHAN0, &config));

    //-------------ADC1 Calibration Init---------------//
    adc_cali_handle_t adc1_cali_chan0_handle = NULL;
    bool do_calibration1_chan0 = water_humidity_adc_calibration_init(ADC_UNIT_1, WATER_ADC1_CHAN0, WATER_ADC_ATTEN, &adc1_cali_chan0_handle);

	for (;;)
	{
        ESP_ERROR_CHECK(adc_oneshot_read(adc1_handle, WATER_ADC1_CHAN0, &adc_raw[0]));
//        ESP_LOGI(TAG, "ADC%d Channel[%d] Raw Data: %d", ADC_UNIT_1 + 1, WATER_ADC1_CHAN0, adc_raw[0]);

		if (do_calibration1_chan0) {
			ESP_ERROR_CHECK(adc_cali_raw_to_voltage(adc1_cali_chan0_handle, adc_raw[0], &voltage[0]));
//			ESP_LOGI(TAG, "ADC%d Channel[%d] Cali Voltage: %d mV", ADC_UNIT_1 + 1, WATER_ADC1_CHAN0, voltage[0]);
		}

        vTaskDelay(pdMS_TO_TICKS(5000));
	}

    //Tear Down
    ESP_ERROR_CHECK(adc_oneshot_del_unit(adc1_handle));
    if (do_calibration1_chan0) {
    	water_humidity_adc_calibration_deinit(adc1_cali_chan0_handle);
    }
}

void water_adc_task_start(void)
{
	xTaskCreatePinnedToCore(&WATER_HUMIDITY_task, "WATER_HUMIDITY_task", WATER_HUMIDITY_TASK_STACK_SIZE, NULL, WATER_HUMIDITY_TASK_PRIORITY, NULL, WATER_HUMIDITY_TASK_CORE_ID);
}


